---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodsDisconnectedWarning
source: html/ab565aea-0d54-a73b-8d11-a7da743b4bc8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodsDisconnectedWarning Property

The hanger rod was disconnected because there is no structural component above.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationRodsDisconnectedWarning { get; }
```